---
kind: method
id: M:Autodesk.Revit.DB.CancellationListener.IsCancelled
source: html/b7dabf1a-03ce-5055-514f-abca52e312bc.htm
---
# Autodesk.Revit.DB.CancellationListener.IsCancelled Method

Returns true if the operation associated with this instance has been cancelled.

## Syntax (C#)
```csharp
public bool IsCancelled()
```